Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རིམ་ཁང་ལྔ་པའི་ནང་ནས་ལྔ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཡང་དག་པར་བགྲོ་བའི་དགའ་བ་ལ་མོས་པ། འཇིག་རྟེན་ལ་ཕན་པ་དང་། བདེ་བའི་སེམས་ཀྱི་སྤྱོད་པ་དང་ལྡན་པ། གཙུག་ལག་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པ་གཟུངས་ཀྱི་ཚུལ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕྱག་རྒྱ་དང་། ཏིང་ངེ་འཛིན་ལས་རྣམ་པར་ལྡང་བ་དང་། ཏིང་ངེ་འཛིན་ལ་རྣམ་པར་དཔྱད་པ་དང་། ཡེ་ཤེས་ཀྱི་སྣང་བ་མངོན་པར་སྒྲུབ་པ་འདུས་ཤིང་འཁོད་པར་མཐོང་ངོ་། །
en: On the fifth floor he saw an assembly of bodhisattvas on the fifth bhūmi who were dedicated to the pleasure of talking together about the Dharma, whose thoughts were concerned with the benefit and happiness of the world, who were accomplished in all treatises, who had the power of retention, who had the seal of samādhi, who rose from samādhi, who analyzed samādhi, and who had attained the light of wisdom.

source: རིམ་ཁང་དྲུག་པའི་ནང་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་རབ་ཏུ་ཐོབ་པ་ཤེས་རབ་ཤིན་ཏུ་ཟབ་པ། རབ་ཏུ་ཞི་བའི་ཆོས་ཐམས་ཅད་མངོན་པར་ཤེས་པ། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། སྙིང་པོ་མང་པོས་སྒོ་ཀུན་ནས་བྱུང་པ། བསྒྲིབས་པ་མྱེད་པའི་སྤྱོད་ཡུལ་ཅན་མྱི་གཉིས་པ་ལ་ཡང་དག་པར་སྤྱོད་པ། ཆོས་ཡང་དག་པར་བགྲོ་བ་ལ་རྣམ་པར་འཕྲུལ་བ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུད་ཀྱི་རྗེས་སུ་འབྲང་ཞིང་རྣམ་པར་དབྱེ་བ་དང་། རབ་ཏུ་གསལ་བར་བྱེད་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་མང་པོ་ཡང་དག་པར་བགྲོ་བ་བྱེད་པ་རྣམས་ཀུན་ནས་འདུས་ཤིང་འཁོད་པ་མཐོང་སྟེ། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཞི་བའི་སྙིང་པོ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འགྲོ་བ་ཐམས་ཅད་དུ་ཡེ་ཤེས་རྣམ་པར་ཕྱེ་བ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་མྱི་གཡོ་བའི་ཀློང་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་རྡུལ་དང་བྲལ་བའི་འོད་ཅེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཐུབ་པར་དཀའ་བ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འགྲོ་བ་ཐམས་ཅད་མོས་པར་བྱེད་ཅིང་རྗེས་སུ་འབྲང་བའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཕྱི་བཞིན་འབྲང་བའི་ཚུལ་གྱི་དཀྱིལ་འཁོར་ཞེས་བྱ་བ་དང་།
en: On the sixth floor he saw bodhisattvas who had attained the state of the perfection of wisdom, who had profound wisdom, who had clairvoyantly perceived the pacification of all phenomena, who came forth from all the gateways that were the essences and gateways of the samādhis and retentions, whose range of activity was free of obscuration, who practiced nonduality, who manifested discussions of the Dharma, and who followed the way of the perfection of wisdom, analyzed it, elucidated it, and discussed the many gateways to the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་རྒྱ་མཚོའི་སྙིང་པོ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཀུན་ཏུ་ལྟ་བའི་བཏང་སྙོམས་ཐོབ་པ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་མི་ཟད་པའི་མཛོད་དང་ལྡན་པ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འགྲོ་བ་རྒྱ་མཚོའི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བ་དང་།
en: These included the gateway to the perfection of wisdom called the essence of peace, the gateway to the perfection of wisdom called the categories of wisdom for all beings, the gateway to the perfection of wisdom called the unwavering turning, the gateway to the perfection of wisdom called the dust-free light, the gateway to the perfection of wisdom called the essence of invincibility, the gateway to the perfection of wisdom called the illumination of beings, the gateway to the perfection of wisdom called the field of the way that is followed, the gateway to the perfection of wisdom called the essence of the ocean, the gateway to the perfection of wisdom called the attainment of all-seeing equanimity, the gateway to the perfection of wisdom called the possession of inexhaustible treasure, the gateway to the perfection of wisdom called the ocean of the ways of the Dharma, the gateway to the perfection of wisdom called following the ocean of beings, the gateway to the perfection of wisdom called unimpeded eloquence, and the gateway to the perfection of wisdom called resting in objectlessness after focusing on the clouds of the Dharma.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཐོགས་པ་མྱེད་པའི་སྤོབས་པ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆོས་ཀྱི་སྤྲིན་ལ་དམྱིགས་པས་རིམ་པས་མྱི་དམྱིགས་པའི་གནས་ཤེས་བྱ་བ་དང་། དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་དེ་དག་ལ་སྩོགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གྲངས་མྱེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བར་ཡང་དག་པར་བགྲོ་བ་བྱེད་ཅིང་། རྒྱན་བརྗོད་དུ་མྱེད་པ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ན་འཁོད་པ་མཐོང་བར་གྱུར་ཏོ། །
en: They discussed the perfection of wisdom through countless millions of such gateways to the perfection of wisdom in a countless array of separate gatherings of assemblies of bodhisattvas.

source: རིམ་ཁང་བདུན་པའི་ནང་ན་བྱང་ཆུབ་སེམས་དཔའ་སྒྲ་བརྙན་ལྟ་བུའི་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ཐབས་དང་ཡེ་ཤེས་རྣམ་པར་གདོན་མི་ཟ་བ་ལ་ཤིན་ཏུ་བྱུང་བ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཡང་དག་པར་འཛིན་པ་ཤ་སྟག་འདུས་ཤིང་འཁོད་པ་མཐོང་ངོ་། །
en: On the seventh floor he saw an assembly of bodhisattvas who had all attained the patience of perceiving everything as echoes, who had given rise to infallible wisdom and method, and who had received the clouds of the Dharma from all tathāgatas.

source: རིམ་ཁང་བརྒྱད་པའི་ནང་ན་བྱང་ཆུབ་སེམས་དཔའ་མ་ཉམས་པར་འགྲོ་བའི་མངོན་པར་ཤེས་པ་རབ་ཏུ་ཐོབ་པ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་རྣམ་པར་རྒྱུ་བ། འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་གཟུགས་བརྙན་རབ་ཏུ་འབྱུང་བ། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་ལུས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ནས་གུད་དུ་མི་འཕགས་པའི་ཡུལ་དང་ལྡན་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྐུ་ལ་ཡང་དག་པར་གཞོལ་བ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་སྔོན་དུ་བརྗོད་པའི་གཏམ་གྱི་སྐྱེས་བུར་གྱུར་པ་ཤ་སྟག་ཀུན་ནས་འདུས་ཤིང་འཁོད་པ་མཐོང་ངོ་། །
en: On the eighth floor he saw an assembly of bodhisattvas who had all attained clairvoyance that would never diminish, who moved within all world realms, whose images appeared within all the gathered assemblies, whose bodies were distributed throughout the entire realm of phenomena, whose field of experience never departed from being at the feet of all the tathāgatas, who encountered the bodies of all the buddhas, and who were the first individuals to speak within the assemblies of the followers of all the tathāgatas.

source: རིམ་ཁང་དགུ་བའི་ནང་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚེ་གཅིག་གིས་ཐོགས་པ་ཤ་སྟག་འདུས་ཤིང་འཁོད་པ་མཐོང་ངོ་།
en: On the ninth floor he saw an assembly of bodhisattvas who were all in their final lifetime.

source: རིམ་ཁང་བཅུ་པའི་ནང་ན་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཐོག་མ་བྱང་ཆུབ་ཏུ་ཐུགས་བསྐྱེད་པ་དང་། སྤྱོད་པ་དང་། འབྱུང་བ་དང་། སྨོན་ལམ་རྒྱ་མཚོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་བའི་ཡུལ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་བཅས་པ་དང་།
en: On the tenth floor he saw when all the tathāgatas first developed the aspiration for enlightenment, their conduct, their setting forth, their oceans of prayers, the range of their buddha miracles, their buddha realms, all their circles of followers, their teaching the wheel of the Dharma, and their power to guide beings.

source: ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྒྲོག་པ་དང་བཅས་པ་དང་། སེམས་ཅན་འདུལ་བ་མཛད་པའི་བྱིན་གྱིས་རླབས་དང་བཅས་པར་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་ཁྱོད་ལ་འདི་ལྟ་བུའི་ཕུན་སུམ་ཚོགས་པ་མངའ་ན།
en: When he had seen this, he asked Ratnacūḍa, the head-merchant patron of the Dharma, “Ārya, how did you gain this pure good fortune?

source: ཕུན་སུམ་ཚོགས་པའི་རྣམ་པ་དེ་ཅི་ལྟ་བུ་ཞིག་ཏུ་སྦྱང་བ་མཛད་མཛད། དགེ་བའི་རྩ་བ་ནི་སུ་ཞིག་ལ་ཡོངས་སུ་བསྐྲུན་བསྐྲུན། དེས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་བོས་དྲན་ཏེ། འདས་པའི་དུས་ཀྱི་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་འདས་པའི་ཡང་ཕ་རོལ་ཅིག་ན། འཇིག་རྟེན་གྱི་ཁམས་འཁོར་ལོ་སྣ་ཚོགས་ཞེས་བྱ་བར། དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིངས་འོད་གཟེར་མཐའ་ཡས་པས་ཡོངས་སུ་བརྒྱན་པའི་ཆོས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ།
en: How did you plant the roots of merit that have ripened in this way?”

source: འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མྱེད་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ། དེ་བཞིན་གཤེགས་པ་དེ་ཡེ་ཤེས་རྣམ་པར་སྣང་བ་ལ་སྩོགས་པ་ཉན་ཐོས་བྱེ་བ་ཕྲག་བརྒྱད་དང་། ཡེ་ཤེས་ཉི་མའི་གཟི་བརྗིད་ལ་སྩོགས་པ།
en: Ratnacūḍa answered, “Noble one, I remember that in the past, more kalpas ago than there are atoms in a buddha realm, there was a world realm called Cakravicitra, and in that world appeared a tathāgata, an arhat, a samyak­saṃbuddha, one with wisdom and conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat named Ananta­raśmi­dharma­dhātu­samalaṃkṛta­dharma­rāja.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། ཐབས་གཅིག་ཏུ་རྒྱལ་པོ་ཆོས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོས་སྤྱན་དྲངས་ནས། བཟའ་ཤང་གི་ར་བ་ཆེན་པོ་རིན་པོ་ཆེ་རྒྱལ་མཚན་རྒྱན་གྱིས་མཛེས་པ་ཞེས་བྱ་བར་གཤེགས་ཏེ། དེ་བཞིན་གཤེགས་པ་དེ་གྲོང་ཁྱེར་དུ་གཤེགས་ནས།
en: That tathāgata, together with a billion śrāvakas, such as Jñānavairocana, and a trillion bodhisattvas, such as Jñāna­sūrya­tejas, having been invited by King Dharmeśvara­rāja, went to the great park called Maṇi­dhvaja­vyūha­rāja.

source: ཚོང་འདུས་ཀྱི་སྲང་ནས་ཚུར་བཞུད་པའི་ཚེ། ཁོ་བོས་དེ་བཞིན་གཤེགས་པ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར། སིལ་སྙན་དང་རོལ་མོའི་སྒྲ་ཞིག་ཀྱང་ཕྱུང་།
en: “When the Tathāgata had entered the town and was passing through the market, in order to make an offering to the Tathāgata and his saṅgha of bodhisattvas and śrāvakas, I played music and burned a pellet of incense to spread the aroma.

source: སྤོས་ཀྱི་རི་ལུ་གཅིག་ཅིག་ཀྱང་བསྲེགས་ཏེ། བདུག་སྤོས་ཀྱིས་བསངས་སོ། །སྤོས་ཀྱི་རི་ལུ་གཅིག་པོ་དེ། དེ་ལྟར་བསྲེགས་པས་ཞག་བདུན་དུ་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཀྱང་སྤོས་ཀྱི་ན་བུན་གྱི་སྤྲིན་ཁ་དོག་སྣ་ཚོགས་དང་ལྡན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དང་འདྲ་བས་ཡོངས་སུ་ཁེབས་པར་གྱུར་ཏོ། །
en: By burning that pellet of incense, the entirety of Jambudvīpa was covered for seven days with multicolored clouds of perfume that took on the forms of all beings.

source: སྤོས་ཀྱི་ན་བུན་གྱི་སྤྲིན་དེ་དག་ལས་ཀྱང་སྒྲ་འདི་སྐད་དུ་བརྗོད་དེ། དེ་བཞིན་གཤེགས་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་སྟེ། དུས་གསུམ་དུ་དྲིམ་མྱེད་པའི་ཡེ་ཤེས་ཀྱི་ཕུང་པོ་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པ་སྟེ།
en: “From those clouds of perfume came these words: ‘The tathāgatas have an inconceivable accumulation of the stainless knowledge of the three times.

source: སྒྲིབ་པ་ཐམས་ཅད་མྱི་མངའ་བའོ།
en: That omniscience is free of all obscuration.

source: ཉོན་མོངས་པའི་བག་ཆགས་ཐམས་ཅད་ཡོངས་སུ་སྦྱངས་པ་སྟེ།
en: They have eliminated all the propensities for kleśas.

source: དེ་བཞིན་གཤེགས་པ་ལ་ཡོན་ཕུལ་བ་ཐམས་ཅད་ཀྱང་། ཐམས་ཅད་མཁྱེན་པའི་དོན་ཆེན་པོ་ཚད་མྱེད་པ་བསྒྲུབ་པར་འགྱུར་རོ། །
en: All that is offered to the tathāgatas will bring the immeasurable great result of omniscience.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡང་དག་པར་གཞོལ་བར་འགྱུར་རོ་ཞེས།
en: It will unite you with omniscience.’

source: དེ་སྐད་དུ་ཁོ་བོའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་དགེ་བའི་རྩ་བ་ལ་ཤུགས་ཡང་དག་པར་བསྐྱེད་པའི་ཕྱིར། སྤོས་ཀྱི་ན་བུན་གྱི་སྤྲིན་དེ་ལས། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་བརླབས་ཀྱིས་སྒྲའི་རྣམ་པ་དེ་ལྟ་བུ་བྱུང་ངོ་།
en: “Those words were emitted from those masses of clouds of incense through the blessing of the Buddha in order to ripen my roots of merit and increase the power of the roots of merit of countless beings.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་བརླབས་ཀྱིས། བསྟན་པའི་ཆོ་འཕྲུལ་གྱི་དགེ་བའི་རྩ་བ་དེ་ཡང་ཁོ་བོས་གནས་གསུམ་དུ་ཡོངས་སུ་བསྔོས་ཏེ།
en: “Noble one, I dedicated the roots of merit from the manifestation of that miracle to three objectives through the blessing of the Tathāgata.

source: གསུམ་གང་ཞེ་ན། འདི་ལྟར་ཕོངས་པ་ཐམས་ཅད་ཤིན་ཏུ་རྒྱུན་གཅད་པ་དང་། དམ་པའི་ཆོས་མཉན་པ་དང་མྱི་འབྲལ་བ་དང་།
en: What are those three?

source: དགེ་བའི་བཤེས་གཉེན་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཐོང་བ། ཡོངས་སུ་རྫོགས་པར་འགྱུར་བར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོས་སོ། །
en: I made the dedication so that I would have the complete vision of all kalyāṇamitras, of all buddhas, and of all bodhisattvas.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ཐོགས་པ་མྱེད་པའི་རྒྱན་ཅེས་བྱ་བ་འདི་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་རིན་པོ་ཆེ་ཚད་མྱེད་པའི་འབྱུང་གནས་སུ་གྱུར་པ། སངས་རྒྱས་ཀྱི་སྐུ་རྒྱ་མཚོ་དང་། ཐ་མྱི་དད་པ་ལ་ཞུགས་པ།
en: “Noble one, I know only this bodhisattva liberation called the unimpeded display of the field of prayer.

source: ཐ་མྱི་དད་པའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡང་དག་པར་འཛིན་པ། ཐ་མྱི་དད་པའི་ཡོན་ཏན་རྒྱ་མཚོ་ལ་ཞུགས་པ། ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པའི་དྲ་བ་རྣམ་པར་རྒྱས་པར་གྱུར་པ། ཏིང་ངེ་འཛིན་ཐ་མྱི་དད་པའི་ཡུལ་ལ་ཞུགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཐ་མྱི་དད་པས་དགེ་བའི་རྩ་བ་རྒྱུན་གཅིག་ཏུ་གྱུར་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་ཐ་མྱི་དད་ཅིང་རྣམ་པར་མྱི་རྟོག་པར་སྤྱོད་པ། དུས་གསུམ་ཐ་མྱི་དད་པས་མཉམ་པ་ཉིད་ལ་ཞུགས་པ།
en: How could I know the conduct or describe the qualities of the bodhisattvas who are the source of limitless good qualities, who have entered an unalloyed ocean of buddha bodies, who have received the rain from unalloyed Dharma clouds, who have entered an ocean of unalloyed qualities, who have extended the net of completely good conduct, who have entered the range of unalloyed samādhis, who have the unalloyed continuous roots of merit of all bodhisattvas, who have the unalloyed nonconceptual conduct of all the tathāgatas, who have entered the unalloyed equality of the three times, who have the unalloyed ability to dwell tirelessly in all kalpas, and who reside on the level of an unalloyed complete range of vision?

source: བསྐལ་པ་ཐམས་ཅད་ཐ་མྱི་དད་པར་ཡོངས་སུ་གནས་པས་མྱི་སྐྱོ་བ།
en: “Depart, noble one.

source: ཀུན་ཏུ་ལྟ་བ་ཐ་མྱི་དད་པའི་ཡུལ་གྱི་ས་ལ་གནས་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཡུལ་སྦའི་རྩ་བ་ཞེས་བ་བ་ཡོད་དེ།
en: In this southern region there is a land called Vetramūlaka.

source: དེའི་གྲོང་ཁྱེར་ཀུན་ནས་སྒོ་ཞེས་བྱ་བ་ན། ཚོང་དཔོན་སྤོས་འཚོང་ཀུན་ཏུ་ལྟ་བ་ཞེས་བྱ་བ་འདུག་གིས།
en: There, in a town called Samanta­mukha, dwells a perfume-seller head merchant by the name of Samanta­netra.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ཀྱི་དྲུང་ནས་སོང་ངོ་།། །།
en: Sudhana bowed his head to the feet of Ratnacūḍa, the head-merchant patron of the Dharma, circumambulated Ratnacūḍa, the head-merchant patron of the Dharma, many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from Ratnacūḍa, the head-merchant patron of the Dharma.

source: སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་ཆེན་པོའི་མདོ། །བམ་པོ་གཉིས་པ། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་སངས་རྒྱས་མཐའ་ཡས་པ་མཐོང་བ་ལ་ཞུགས་པ།
en: Samanta­netra Chapter 19 Sudhana, the head merchant’s son, had perceived the visions of infinite buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་པ་དང་འགྲོགས་པ་རབ་ཏུ་ཐོབ་པ།
en: He had attained the companionship of infinite bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་མཐའ་ཡས་པའི་ཚུལ་གྱིས་སྣང་བར་གྱུར་བ།
en: He had been illuminated by the infinite ways of the paths of the bodhisattvas.

source: ཆོས་ཀྱི་ཚུལ་མཐའ་ཡས་པས་མངོན་པར་བརླན་པས་ཤིན་ཏུ་རྟོགས་པའི་སེམས་དང་ལྡན་པ།
en: His mind had certainty through being saturated by the infinite ways of the Dharma of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་མོས་པ་མཐའ་ཡས་པའི་ལམ་གྱིས་རྣམ་པར་དག་པ།
en: He purified the path of the infinite motivations of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་མཐའ་ཡས་པའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: He had attained the brilliance of the infinite faculties of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་མཐའ་ཡས་པའི་སྟོབས་ལ་གནས་པ།
en: He dwelled in the infinite aspirations of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཐའ་ཡས་བའི་རྗེས་སུ་སོང་བའི་སེམས་དང་ལྡན་པ།
en: His mind followed the example of the infinite conduct of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་མཐའ་ཡས་པའི་སྟོབས་ཡོངས་སུ་སྐྱེས་པ། བྱང་ཆུབ་སེམས་དཔའ་གཞན་གྱིས་ཐུབ་པ་མྱེད་པ། མཐའ་ཡས་བའི་རྒྱལ་མཚན་ཅན།
en: He possessed the banner of the infinite invincibility of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་སྣང་བ་མཐའ་ཡས་པའི་རྒྱུད་དང་ལྡན་པ།
en: He possessed the movement of the infinite light of wisdom of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་མཐའ་ཡས་པའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ་དེ་མཐར་གྱིས་ཡུལ་སྦའི་རྩ་བ་གང་ན་བ་དེར་ཕྱིན་ནས།
en: He had attained the infinite illumination of the Dharma of the bodhisattvas.

source: གྲོང་ཁྱེར་ཀུན་ནས་སྒོ་ཡོངས་སུ་ཚོལ་ཞིང་ཕྱོགས་དང་།
en: Sudhana eventually arrived in the land of Vetramūlaka, and he searched everywhere for the town of Samanta­mukha, unwearyingly, fearlessly, and with unflagging diligence and an inviolable determination.

source: ཕྱོགས་མཚམས་དང་། ཡུལ་ཕྱོགས་ཉེན་ཀོར་ཀུན་དང་། སྒང་དང་གཤོང་དང་། མཉམ་པ་དང་མྱི་མཉམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་སྐྱོ་བ་མྱེད་པའི་བསམ་པ་དང་། འཇིགས་པ་མྱེད་པའི་སེམས་དང་། ལྡོག་པ་མྱེད་པའི་བརྩོན་འགྲུས་དང་། ཐུབ་པ་མྱེད་པའི་སེམས་ཀྱིས།
en: He searched in the principal and intermediate directions, the districts and subdistricts, high and low, up and down.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་མ་བརྗེད་པ་དང་། རྟག་ཏུ་དགེ་བའི་བཤེས་གཉེན་གྱི་སྤྱོད་པ་མ་ནོར་བས་སེམས་རབ་ཏུ་བསྒོས་པ་དང་། སྒོ་ཀུན་ནས་རྣམ་པར་དམྱིགས་པའི་དབང་པོ་དང་ལྡན་པ་དང་། བག་མྱེད་པ་ཐམས་ཅད་དང་བྲལ་བ་དང་།
en: He never forgot the instructions of the kalyāṇamitras, always keeping the perfect conduct of the kalyāṇamitras in his heart, possessing the faculties that were all observant, devoid of all carelessness, his eyes and his ears never distracted.

source: མྱིག་དང་རྣ་བ་གཡེང་བ་མྱེད་པར་ཀུན་ཏུ་ཚོལ་ཚོལ་ནས་ཡུལ་སྤའི་རྩ་བའི་དབུས་ཤིག་ན།
en: Having searched everywhere, Sudhana finally saw, in the center of the land of Vetramūlaka, the town of Samanta­mukha.

source: གྲོང་ཁྱེར་ཀུན་ནས་སྒོ་ཚོང་འདུས་ཀྱི་རྡལ་སྟོང་ཕྲག་བཅུའི་གནས་སུ་གྱུར་པ།
en: It was a town with ten thousand marketplaces.

source: དེ་ཤིན་ཏུ་བཟང་པོར་གྲུབ་པ།
en: It was excellently built.

source: རབ་བརྟན་པས་བསྐོར་བ།
en: It was encircled by a strong wall that was very high.

source: ཤིན་ཏུ་མཐོ་བ་བཞི་མདོ་བརྒྱད་ཀྱིས་བརྒྱན་པ་འདུག་པར་མཐོང་སྟེ།
en: It was beautified by having eight crossroads.

source: དེའི་ནང་ན་སྤོས་འཚོང་ཀུན་ཏུ་ལྟ་བ་ཡང་སྤོས་འཚོང་གི་ཁྱམས་ཤིག་ན་འདུག་པ་མཐོང་ནས།
en: In the middle of the town, Sudhana, the head merchant’s son, saw the perfume seller Samanta­netra in a perfume shop.

source: སྤོས་འཚོང་ཀུན་ཏུ་ལྟ་བ་གང་ན་བ་དེར་ཕྱིན་ཏེ། སྤོས་འཚོང་ཀུན་དུ་ལྟ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། མདུན་དུ་འདུག་སྟེ།
en: He approached the perfume seller Samanta­netra, bowed his head to Samanta­netra’s feet, and sat down before him.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་མཚལ་ཏོ།
en: With his hands together in homage, he said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ། རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནད་ཤེས་ཏེ། རླུང་ལས་གྱུར་པ་དང་། མཁྲིས་པ་ལས་གྱུར་པ་དང་། བད་ཀན་ལས་གྱུར་པ་དང་། ཆ་མཉམ་པར་འཁྲུགས་པ་དང་། གཞན་གྱིས་གནོད་པར་བྱས་པ་དང་། མི་མ་ཡིན་པ་ལས་གྱུར་པ་དང་། དུག་འཐུངས་པ་དང་།
en: Samanta­netra said, “Noble one, it is excellent, excellent that you have developed the aspiration for the highest, complete enlightenment.

source: སྔགས་དང་། མཚོན་དང་། རོ་ལངས་པའི་སྦྱོར་བ་སྣ་ཚོགས་དང་། མེ་ལས་གྱུར་པ་དང་། ཆུས་བསྐྱོད་པ་ལས་གྱུར་པ་དང་།
en: “Noble one, I know the illnesses of all beings: those that come from air, those that come from bile, those that come from phlegm, those that come from their balance being disturbed, those that come from harm by others, and those that come from nonhuman beings, from drinking poison, from the effects of various mantras, weapons, and vetālas, from the agitation of water, and from various fears and terrors.

source: སྔངས་པ་དང་འཇིགས་པ་སྣ་ཚོགས་ལས་གྱུར་པ་ཐམས་ཅད་ཀྱང་ཤེས་སོ།
en: I know them all.

source: ནད་དེ་དག་ཐམས་ཅད་ཞི་བར་བྱ་བ་ཡང་ཤེས་ཏེ། འདི་ལྟར་སྣུམ་པར་བྱ་བ་ཡང་རབ་ཏུ་ཤེས་སོ། །སྐྱུག་པར་བྱ་བ་དང་། བཀྲུ་བ་དང་། བརྟ་བ་དང་། གཏར་བ་དང་། སྣའི་ཆོ་ག་དང་། ཉ་ར་དང་། དུགས་དང་། ལུམས་དང་།
en: I also know how to cure all those illnesses.

source: བྱུག་པ་དང་། དུག་གསོ་བ་དང་། འབྱུང་པོའི་གདོན་མྱེད་པར་བྱ་བ་དང་། བཅུད་དང་། ཁྲུས་དང་།
en: I know oiling, emetics, purgatives, enemas, bloodletting, inhalations, sweating, compresses, unguents, massaging, antidotes, exorcisms, nourishment, bathing, resting, causing growth, purifying the complexion, and increasing strength.

source: བཞག་པ་དང་། བསྐྱེད་པ་དང་། ཁ་དོག་སྦྱང་བ་དང་། ཉམ་བསྟོད་པའང་རབ་ཏུ་ཤེས་ཏེ། རིགས་ཀྱི་བུ་ཕྱོགས་བཅུ་ནས་སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་ཁོ་བོའི་དྲུང་དུ་འོང་བ་དེ་དག་ཐམས་ཅད་ཀྱི་ནད་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཞི་བར་བྱེད་དེ།
en: “Noble one, I cure all the illnesses of all the beings who come to me from the ten directions.

source: ནད་སོས་ནས་ཀྱང་ལེགས་པར་བཀྲུ་བ་དང་ལུས་ལ་བྱུག་པས་བྱུག་པ་བྱས་ནས། ཅི་ཚུལ་གྱི་རྒྱན་གྱིས་ཡན་ལག་ཤིན་ཏུ་བརྒྱན་ཏེ། ཅི་རིགས་པའི་གོས་ལུས་ལ་བསྐོན་ནས། ཁ་ཟས་བྲོ་བའི་མཆོག་དང་ལྡན་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱས་ཏེ། ནོར་དཔག་ཏུ་མེད་པས་ཀྱང་ཕུན་སུམ་ཚོགས་པར་བྱེད་དོ། །
en: When I have healed them, I have them bathed, their bodies anointed with unguents, their limbs adorned with jewelry, and their bodies dressed in clothes; I satisfy them with foods that have various kinds of excellent flavors and make them fortunate with immeasurable wealth.

source: དེའི་འོག་ཏུ་ཡང་དེ་དག་ལ་མི་གཙང་བ་བསྟན་ཅིང་། །འདོད་ཆགས་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: “Afterward I teach them the Dharma so that through being taught impurity they will eliminate desire.

source: བྱམས་པ་ཆེན་པོ་ཡོངས་སུ་བསྔགས་ཤིང་ཞེ་སྡང་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: “I teach them the Dharma so that through the praising of love they will eliminate anger.

source: ཆོས་རྣམ་པར་དབྱེ་བའི་བྱེ་བྲག་བསྟན་ཅིང་གཏི་མུག་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: “I teach them the Dharma so that through the teaching of the particular categories of phenomena they will eliminate ignorance.

source: ཁྱད་པར་ཁོང་དུ་ཆུད་པའི་ཚུལ་གྱི་སྒོ་ཡང་དག་པར་བསྟན་ཅིང་ཆ་མཉམ་པའི་སྤྱོད་པ་དང་། ཉོན་མོངས་པ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: “I teach them the Dharma so that through the teaching of the gateways to the ways of special realizations they will eliminate the conduct that comes from all kleśas equally.

source: སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱི་ཆོས་དང་ལྡན་པའི་གཏམ་ཐམས་ཅད་ཡོངས་སུ་བརྗོད་ཅིང་བྱང་ཆུབ་ཀྱི་སེམས་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I elucidate for them the cause for the arising of the aspiration for enlightenment by relating to them descriptions of the phenomena that are the qualities of the buddhas.

source: འཁོར་བའི་སྡུག་བསྔལ་ཚད་གཟུང་དུ་མྱེད་པ་ཡོངས་སུ་བསྟན་ཅིང་། སྙིང་རྗེ་ཆེན་པོ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I teach them the cause for the arising of great compassion by teaching them the immeasurable sufferings of saṃsāra.

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་རྒྱ་ཆེན་པོ་བསྩགས་པ་ཡང་དག་པར་བསྔགས་ཤིང་ཡོན་ཏན་ཚད་མེད་པ་འཐོབ་པ་དང་། འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I teach them the cause for the arising and attainment of measureless qualities by praising the gathering of a vast accumulation of merit and wisdom.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བར་བྱ་བ་ཡོངས་སུ་བསྟན་ཅིང་ཐེག་པ་ཆེན་པོའི་སྨོན་ལམ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I teach them the cause for the arising of Mahāyāna prayers by teaching them how all beings should be ripened and guided.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དང་། བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པར་བྱ་བའི་སྤྱོད་པའི་དྲ་བ་ཤིན་ཏུ་རྒྱས་པར་བཤད་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་འཐོབ་པ་དང་། འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I teach them the cause for the arising and attainment of the completely good conduct of the bodhisattva by explaining the vast net of their conduct of dwelling in all buddha realms and all kalpas.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བསྔགས་ཤིང་མཚན་དང་དཔེ་བྱད་བཟང་པོས་བརྒྱན་པའི་སངས་རྒྱས་ཀྱི་སྐུ་འཐོབ་པ་དང་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I teach them the cause for the arising and attainment of a buddha’s body adorned with the signs and features of a great being by praising the perfection of generosity.
